# RoomPowerLoadUnitsParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RoomPowerLoadUnitsParam Property
ParameterTypeId Class See Also
---
"Power Load Units"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RoomPowerLoadUnitsParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomPowerLoadUnitsParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RoomPowerLoadUnitsParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace